[
  {
    "Author": "Casey REAS",
    "Title": "title? #58",
    "Text": "I was around for the birth of p5.js and I’m around now for the 1.0 release over six years later. My greatest contribution to the project was to keep my nose out of it. Through Lauren’s guidance and energy, p5.js has grown into something completely different from its parent, Processing. Both projects share the same domain and emphasize community and learning, but p5.js imagines a new, refreshing approach to situating coding within the arts and vice versa. Processing’s core is rooted in the culture at the turn of the century and p5.js points beyond 2020.\n\nAs I was thinking about the p5.js 1.0 release, something brought be back to the early days — to 2013. Some email searching to jog my memory led to a Github issue started on 29 August with the name “title?” The text that follows below is an edited discussion about how to name the nascent project that would become what we know as the amazing p5.js.\n\nThe cast of characters are Evelyn Eastmond (@evhan55), me (@REAS), Lauren McCarthy (@lmccart), Chandler McWilliams (@brysonian), Erik Blankenship (@jedierikb), and Dan Shiffman (@shiffman). The full discussion is here: https://github.com/processing/p5.js/issues/58\n\ntitle? #58\n\nevhan55 opened this issue on Aug 29, 2013 · 19 comments\n\nevhan55 commented on Aug 29, 2013\n\n@lmccart\n\nWhat is the official name of this library?\n\nProcessingJS\n\nProcessing-JS\n\nProcessing-js\n\nprocessing.js\n\nprocessingjs etc....\n\nHow are we differentiating from Processing.js?\n\nKeeping track of Processing, processing.org, Processing.js and processingjs.org and now this new library is going to be really confusing to many people. Perhaps something to bring up in the September4th/5th meeting?\n\nREAS commented on Sep 11, 2013\n\nRight now, I'm leaning toward the minimal “P5“ as the project name. I'm still fond of 'Ciel.' I'm curious about what the RISD grads might come up with.\n\nlmccart commented on Sep 12, 2013\n\nhm, it is an abbreviation for perl 5, but I think not too much googling overlap there.\n\nbrysonian commented on Oct 10, 2013\n\np5js has a lot of results, and p5js.com so that might not solve the confusion. I can't come up with much either though. I did like the name Cing for that cpp project that was going on. Maybe something similarly odd/nice sounding? jxing?\n\njedierikb commented on Oct 10, 2013\n\np5j5 ?\n\nhas a nice r2d2 ring to it.\n\nREAS commented on Oct 10, 2013\n\nMy daughter says “3PPO“ instead of C3PO. I wonder what we can learn from that?\n\nbrysonian commented on Oct 10, 2013\n\nppppp.js\n\nshiffman commented on Oct 10, 2013\n\ni think if you put a P in front of it, it will be perfect.\n\nlmccart commented on Oct 11, 2013\n\n👍\n\nevhan55 commented on Oct 25, 2013\n\nThe RISD grads haven't really chimed in, unfortunately. They are still getting a grasp of the difference between Processing, Processing.JS and this new version, and none of the students in my section have suggested alternatives.\n\nI am starting to lean towards “P5“ but not exactly fond of “ppppp“, it seems like a mouthful and beginners might wonder why. Also still really like “Ciel“ or anything completely different and fresh, but since this library builds on the Processing API so closely, the tie to 'proce55ing' seems nice.\n\nAlthough a quick Google search... http://www.sojamo.de/libraries/controlP5/\n\nIs P5 used in other places to refer to Processing?\n\nbrysonian commented on Oct 25, 2013\n\nIt was for years, not as much anymore. Something simple like draw.js might be nice too.\n\nREAS commented on Oct 25, 2013\n\n… After receiving so much negative feedback about the name “Processing“ over the years, I think common usage language names are tricky. However, maybe the advantages of the simple “draw.js“ outweigh these negatives. @evhan55, people naturally named Processing libraries with “pro“ and “p5“, but we discouraged them because it made them feel “official“ rather than “contributed.“ I don't think this is an issue for your project.\n\nlmccart closed this on Nov 1, 2013\n\njedierikb commented on Nov 1, 2013\n\nAnd... The title is????\n\nlmccart commented on Nov 1, 2013\n\nI believe we have settled on p5.js. @evhan55, is this right or is this still tentative?\n\nevhan55 commented on Nov 1, 2013\n\np5.js :)",
    "Bio": ["is an artist.", "is an artist and co-founder of Processing.", "is an artist and co-founder of Processing and the Processing Foundation.\nhttp://reas.com/"],
    "Illustration": "open-system.jpg",
    "Alt": "This is some alt text"
  },
  {
    "Author": "Aarón Montoya-Moraga",
    "Title": "why i love p5.js and how did i get here",
    "Text": "p5.js is my favorite community, people, software, tool\nlet me first explain my journey so far, and highlight great people i have met\n2011 i used to be a struggling electrical engineering undergrad\nprofessor Rodrigo Cádiz who invited me to a computer music workshop\ni learned we could use code for arts, and met a beautiful community of media artists\n2012 i started learning Processing and still didn't understand what free libre open source meant\n2013 artist Margarita Gómez showed me openFrameworks and i couldn't figure out how to use it\n2014 performance artist María José Contreras hired me for my first job as a programmer for arts\ni met Delight Lab and they taught me some video mapping, i was hooked\n2015 i was accepted to NYU ITP, a two-year graduate school media arts program\nit was the first time they taught p5.js to first years instead of the usual Processing\nwe learned how to program cool wacky interactive websites and how the internet worked\nsince then i haven't stopped using p5.js :)\n2016 i took my favorite class at grad school, Lauren McCarthy's Performing User\ncheck it out, it is amazing  itp.nyu.edu/classes/performinguser/syllabus\nat engineering school i had been taught programming as an useful skill for making money\nat art school i was inspired by the creative potential of computers\ni became convinced artists and society would benefit from using code as a creative medium\none of my biggest privileges has been learning English and through that, access to education\nbut if you don't know English, i guess it's hard to know what you're missing, like p5.js\ni wished kids from Spanish speaking communities would have no barriers to their arts education\ni got a grant from the Processing Foundation that summer\nmy proposal was to translate to Spanish the p5.js website and book, and teach workshops\nthe website i18n had been started by Maya Man and i learned so much from her work\ni did rough translations of the book and website, but i feltl i should do more\n2017 after grad school, i spent that summer finishing the translations\nLee Tusman mentored me, Daniel Shiffman and Rune Madsen helped with code for the book\nTaeyoon Choi translated the artwork, Tyler Yin and Casey Reas made the book a reality\ni explained to Dorothy Santos, Lauren and Casey that the book should be online,\nin both pay-what-you-want PDF and optional physical copies\nand that all the source code should be available online for everyone to contribute\nthey were encouraging and made this dream a reality\nhere is the source code https://github.com/processing/p5.js-getting-started-es\nand the PDF and link for ordering physical copies https://processingfoundation.press/\ni was hired by NYU ITP to stay for one academic year as a research resident\nwith four of my best friends we started a media arts school called CODED Escuela\nCamila Colussi, Natalia Cabrera, Guille Montecinos, Christian Oyarzún\ntogether we taught p5.js in Chile and fostered the Chilean media arts community\n2018 i represented Processing Foundation in Argentina for the +CODE Festival\npeople were so excited to learn p5.js and celebrating media arts\n2019 i helped organize and taught at the Processing Community Day in Quito Ecuador with friends Gabriel Andrade, Ava Huang, Sharon Lee de la Cruz, Andrés Colubri\ni joined MIT where i am creating open source tools for arts and learning digital rights\ni attended the the second p5.js contributor's workshop and worked on the global track\nwith Yasheng She, Qianqian Ye, Kenneth Lim, Luis M-N, and so many others!\nwe helped each other figure out the role of p5.js in a worldwide context\nand discussed the sociopolitical aspects of software, of media arts, of sharing\n2020 in two months i will go again to PCD in Ecuador with Francesca Rodríguez-Sawaya\nshout out to Saber Khan for organizing Processing Community day 2020\neveryone i have met through p5.js and Processing has been inspiring and caring\nthey advice me to please don't burn out, to please self care, and enjoy the process\none of my favorite moments ever was when Francesca tagged me on a picture\nof the p5.js book in Spanish being used at schools in NYC to learn media arts\nthank you p5.js friends for caring about each other\nthank you for making this world a happier more ethical place with more art\n:)",
    "Bio": ["uses synthesizers, machine learning, and computers for real-time audiovisual art projects, and is a contributor and open source software enthusiast, regularly teaching with and contributing to the p5.js, ml5.js, and Kinectron projects. https://montoyamoraga.io"],
    "Illustration": "weak-ties.jpg"
  },
  {
    "Author": "Taeyoon Choi",
    "Title": "Oddkins",
    "Text": "This drawing by Taeyoon Choi was originally commissioned for the Getting Started with p5.js book by Lauren McCarthy, Casey Reas, and Ben Fry.\n\nI'm an oddkin of p5.js contributors. Oddkin is a word Donna Haraway uses to describe an unlikely intimacy. The word oddkin captures the essence of friendship I have in personal life, intellectual kinship with my students and peers at the School for Poetic Computation and in the geographically diverse nature of the Processing community. I'm bilingual, it's natural for me to try to translate the word into Korean. I looked up kin, which is 친척 (親戚 in Chinese). I don't think the word oddkin is translated into Korean. I asked if anyone would help translate it, and the media artist Masayuki Akamatsu suggested 기묘한동류 (妙な同類 in Japanese). It doesn’t have the earthy, crittery feel of oddkin, but it’s close enough. In this essay, I take an opportunity to think about you, my oddkins.\n\nDear oddkins. I’ve been lucky to participate in and help with the p5.js contributors conference at the STUDIO for Creative Inquiry in 2015 and remain a fan of the project. Some of my colleagues and students say they are trying to 'democratize' technology by making tools or resources. I'd like to challenge the implications created by the use of the word 'democracy' in this context. 'Democracy,' unlike ‘accessibility,’ implies a fair distribution of power, representation, and equity for everyone, but is complicated by ongoing questions of citizenship. How many times have you heard a hacker say, “I made this open source tool. Now everyone can do what I do!” What they don’t say is that to use it, you need to be technically fluent, accepted as a technical person, and have access to computers and networks. In reality, tools and resources alone cannot be democratic.\n\nWhat the p5.js project has done differently from the beginning is demystify stereotypes of who is seen as technical and/or artistic–the myth of the lone engineer capable of creating a powerful framework–and create a technical community where non-technical contributions are valued equally. This approach is truer to the reality of software and hardware development. There are almost always non-technical contributors who are integral to the success of any technology, including but not limited to writers, educators, testers, designers, and Quality Control professionals.\n\nThe questions of whiteness in the technology field remains. I've attended numerous software and hardware conferences over the years. Some were highly exclusive and self-selective, others were open and inviting to the newcomers. In the U.S. and Europe, the conference attendees were dominatingly white males. I could write a book about the troubling experiences I’ve had and witnessed at tech conferences. Older, established, white male engineers and academics making rude comments to female, gender non-conforming, people of color might need  a few chapters. Young tech dudes promising to solve the world's greatest challenges with code. “Introverts” who are actually just snobbish, escaping to their devices to avoid human contact but invasively stalking women with confidence. The most insidious forms of racism that happen offstage. How our speaker badge isn't enough for us to enter the speakers' lounge, how white bartenders treat us with offhand racist jokes, how we are tokenized for photo opportunities and a shout out on diversity statement. They can all get a chapter of their own in my book.\n\nTo survive in white spaces as a person of color, I learned to adapt to the expectations of others at first. Once I felt grounded, I leveraged my place to give voice to the others. Speaking up my truth made some people uncomfortable and I may have lost some opportunities. Speaking up brought me the respect of others, especially those who hold the power in white spaces.\n\nHow does one speak up to challenge the establishment? I think nuance and candor are essential to start a conversation. No one likes to be criticized, but everyone loves to be understood. When I was learning to code, a friend told me “treat your computer like your younger sibling.“ This approach of care and play is essential in exploratory and poetic computing. I think a similar approach is necessary to navigate the tech community. As the p5.js project grows in it’s scale and diversity, I want to ask. Who do we make our oddkins?",
    "Bio": ["is an artist and a cofounder of the School for Poetic Computation. https://taeyoonchoi.com https://sfpc.io"],
    "Illustration": "taeyoon.png"
  },
  {
    "Author": "Aren Davey",
    "Title": "p5.js as a Family",
    "Text": "Image from the p5Grid library by Aren Davey: https://github.com/aahdee/p5grid\n\nCreating is a verb that I find describes my childhood and teenage years. By designing, crafting, and building, I morphed my wild imaginations into tangible objects. Intricate patterns and inventions sprung from my daydreams in my high school classes. I honestly wanted to choose graphic design or architecture for my career path, but since I did very well in the maths and sciences, my family pushed me towards those fields instead with the reason that they didn’t want my talents to go to waste. Since I didn’t want to disappoint them and I actually had an interest in engineering and scientific research, I promised that I’ll go to college for a degree in that field and almost completed every math class my high school offered. I also arrived at school almost an hour earlier for extra art classes, completed many studios, and did independent art study. Whether my intense motivation was to expand my interests or an act of small defiance is up for discussion, but my art practice has always been seen as an afterthought. Thus, I started to innately see it as an afterthought as well.\n\nQuite frankly, the p5.js community is not a group that I expected myself to be in. Having been intrigued by the concept of Processing and p5.js, I used the platform for my school work and expected that to be the extent of my involvement. Then through a string of chance happenings, I ended up at the 2019 p5.js Contributors Conference. I immediately felt out of place because I didn’t really feel like I deserved the title “contributor”. Like, I was 21, still in college but hanging on for dear life, and felt invisible compared to the other contributors that had a pretty substantial Twitter presence and were speaking at or hosting large conferences like Eyeo, maybe SIGGRAPH. I’d be entirely grateful if I could just see the door to the SIGGRAPH exhibition hall. One of the other attendees happened to be a visiting professor that was teaching a class that I was enrolled for the upcoming semester. All of these people are doing great things that were impacting the p5.js community and beyond so I didn’t feel like I deserved to be on the same level as them. Creating was only applied to projects that I finished for a grade, so I hadn’t ever done anything that I designed and executed myself. Thus, I felt pretty lost and doubtful if I could ever create anything for this community.\n\nBut after receiving the feedback that I got from pitching an idea that I had sitting in my head for a few months, creating a very dirty alpha for that idea, and seeing a visible, tangible, actual product sprout from that, I finally felt like a contributor. I saw that my art practice was taken seriously by others and there was genuine interest and need for it. Both of my interests, software development and fine arts, were seen of equal value and status. One wasn’t inherently better than the other, but instead they are both appreciated and valued in their own way. The p5.js community is a place where that holds true, so I’m glad that they have accepted me and that I have the chance to give back to them.\n\nI sometimes prefer to call the p5.js community a family instead. It’s more tight knit than other online developmental communities and its members are genuinely interested in the progress and evolution of others. I might not have the same amount of experience as most of the members, but that doesn’t make me less of a contributor. Everyone here is ready to assist others who need it and ensure that they go to places that they have never thought of before. This family exposed me to things I wouldn’t have seen without their help and has helped me develop as an artist and a contributor. No longer is my art practice felt as an afterthought; it is a significant piece of myself that is worth exploring, developing, and investing in and I’m very glad the p5.js family helped me come to that conclusion.",
    "Bio": ["is a developer, artist, and aspiring graphic designer currently based in Pittsburgh. She is currently an undergraduate student at Carnegie Mellon University, pursuing a Bachelor of Computer Science and Fine Arts. She strives to break the stereotypes of programming by showing that it can be warm, playful, and spontaneous. In her downtime, she likes to steep tea, play video games, and pay homage to hexagons.  https://github.com/aahdee"],
    "Illustration": "aren.png"
  },
  {
    "Author": "Stalgia Grigg",
    "Title": "p5 Fellow Experience",
    "Text": "During 2019, I served as a fellow for p5.js. During this year I was given the opportunity to operate as a co-leader for the project. This meant that I was given agency and responsibility in everything from maintaining the open-source codebase and developing a vision for future governance to designing the documentation for welcoming new contributors and honing the release roadmap based on the community mission. I have been a contributor to p5 for several years now, but it wasn’t until my experience with this fellowship that I finally understood the significance of the example that p5 is setting.\n\nMy path as a software developer has been closely aligned with p5 from the beginning. My first experiences coding were with p5. I first encountered a for-loop in the late nights poring over the online reference and examples for the p5 library as I made small experimental creative sketches. This began a lifelong dedication to and love for the craft of programming. That dedication led me to become a contributor to the project. I learned how to work on an open-source project through my engagement with p5. I can say confidently that if it wasn’t for the generous patience and understanding of the p5 community I would’ve been too intimidated or discouraged by my early mistakes to push through and achieve confidence in my status as a contributor. The p5 community offered a sense of comfort in learning through doing. This meant that I was able to learn a more advanced approach to software development and library architecture design, but it also meant that I learned by example how to be a steward for a web community. This process of learning eventually culminated in my experience as a fellow.\n\nAs a fellow, the responsibility that I was given gave me insight into the intention that forms the overarching shape of the project. p5 offers every possible avenue for involvement and empowerment. It offers a vast library of supporting educational resources so that people can learn how to code by making things. It offers a site for consideration and discussion of how a radically-inclusive software project can be a political act. It offers an intimidation-free, encouraging space to experiment with open-source contribution. It offers a flexible vision and malleable governance that empowers any contributor to reimagine the future of the project. All of these different angles for engagement are made available to anyone that shares a passion for p5’s mission. This forms an entire ecosystem that works tirelessly to empower people that have been historically left out of the conversation of how software tools and the open-web are built. My deep engagement with the p5 community led me through all of these different angles over time, giving me the gift of a path from self-taught coder to community-leader, software advocate, and mentor.\n\nMy experience as a p5 fellow has been formative in my understanding of how I want to interact with the world as a software engineer, tool-maker, developer, and activist. The approach that p5 exemplifies, community-forward and porous, is one that will fundamentally inform my future work organizing projects that fight for a radically-inclusive and definitively-open web.",
    "Bio": ["is dedicated to the indeterminate. http://stalgiagrigg.name/"],
    "Illustration": "swarm-pattern.jpg"
  },
  {
    "Author": "Olivia McKayla Ross",
    "Title": "How to Write Non-Violent Creative Code",
    "Text": "A WIP Introduction, facilitated by Olivia Ross\n\nhttps://bit.ly/39ow5to\n\n During the 2019 p5.js Contributors' Conference, a group formed to discuss how radical inclusion, decolonization, and a de-centering of dominant communities could be further integrated and emphasized in p5.js as a toolkit and a community. We acknowledged and discussed the ways in which p5.js is built upon (and benefits from) colonial projects like the English language, the Internet, and their related infrastructures.\n\n It’s always an option to throw our laptops into the ocean and bow out, but we have chosen not to.\n\n We agreed to strategize how we as practitioners and toolmakers can reindigize creative coding, starting in the areas where we have the most agency—ourselves and our works.\n\n “Reindigenization is not a repeat of the past, it is the revolutionary/evolutionary RETURN to ways of life with and for the land.“\n\n Drawing from a collective list of references, we've drafted a set of guidelines, questions, and prompts to help us and others reflect and refine our work in this spirit.\n\n The term “nonviolent creative code“ was proposed to guide this work. In this context, we use the term violence to include actions that keep us from the earth, from ourselves, and from each other.\n\n The World Report on Violence and Health also presents a typology of violence that, while not uniformly accepted, can be a useful way to understand the contexts in which violence occurs and the interactions between types of violence. This typology distinguishes four modes in which violence may be inflicted: physical; sexual; and psychological attack; and deprivation.\n\n Honor the Land\n\nWho is the community who lives here? Who is the audience of your work? Are those two populations different or the same? Why?\n\nAre you living or working on occupied land? Who is the indigenous population where you are?\n\nIs this art taking up material space? How have you considered managing the waste generated by this project?\n\nConsider the materiality of the server, the data center, the cable, the rare-earth mineral mine, the factory, the oil field, the air conditioner, and the other things that are holding up this practice. Where can you decouple those links?\n\nWhat is lost when reduced to data? What is there about your place that is not saved in the online database or archive? How does it feel here?\n\n Honor the Body\n\nThere is an assumption that writing and coding are leisurely because you’re sitting, but there’s also posture issues, carpal tunnel, etc. Take breaks, drink water, protect your eyes, etc. Honor your body cues as data.\n\nWhose bodies have contributed to your work? Who answered that question on Stack Overflow, who made this font, who assembled your computer? How are those bodies visible or invisible?\n\nDoes your work respect all participants’ body sovereignty? Some participants may not wish to be photographed, recorded, scanned, or touched. How are you honoring these sacred boundaries?\n\n Honor the Small\n\nDoes your project need to scale? What would your project gain from specificity? De-emphasize growth as a goal of a project. Instead, think of growth as one of many design principles.\n\nCan you produce or share work on a large platform (Twitter, Instagram, etc), without doing work for that platform? How can you decouple your online practice from tech giants?\n\n Honor the People\n\nHow do you prioritize consent in online space? Does engaging with your work require the participant to sign a terms of service? Do you control that terms of service, or is it in the control of a company or organization?\n\nHow do you protect your community? If you are making work that uses or stores information about the data, interactions, or bodies of others, how do you keep that safe?\n\nPay attention to when you use language like “mining” data. How can you maintain an explorative, rather than exploitative, relationship with the data collection process?\n\nDoes the code you’re writing/using support structures of violence? Do the toolkits you use align with the values of consent and dignity?\n\nWhat is the offboarding process for someone who would like to stop interacting with your work? What can they take with them? What do you do with the things they have left behind (data, feedback, etc.)? Can people take breaks with the option of returning without penalty?\n\nDoes your project use design patterns that mirror cycles of addiction (e.g copying the slot-machine)? How can it promote healthy, balanced relationships with technology?\n\n Honor the Exchange\n\nHow can your work prioritize community and relation?\n\nDissolve hierarchy in your teaching/learning by respecting wisdom in all its forms. New participants always have another expertise.\n\nIs the code you’re writing intentionally or unintentionally so hard to read or obscure that others cannot learn from or contribute to it? Why?\n\n Special thanks to the members of global + access tracks at the p5.js contributors conference, including but not exclusive to:\n\n Olivia McKayla Ross\n Allison Parrish\n American Artist\n Guillermo Montecinos\n Luisa Pereira\n Lauren Lee McCarthy\n Everest Pipkin\n Yasheng She\n Evelyn Masso\n Dorothy R. Santos\n Xin Xin\n Luca Damasco\n Kate Hollenbach\n Qianqian Ye\n Cassie Tarakajian\n Aarón Montoya-Moraga\n",
    "Bio": ["is an 18 year old media artist and programmer from Queens, New York City. She hopes to help others model their own practices of exploding conventional dichotomies of user vs. programmer and noise vs. signal, while also building a framework for interrogating the faith economies that underlay electronics and communications technologies. https://oross.net"],
    "Illustration": "open-water-2.jpg"
  },
  {
    "Author": "Claire Kearney-Volpe",
    "Title": "p5 Access, Keep it Coming!",
    "Text": "In 1996, the World Wide Web Consortium (W3C) formed the Web Accessibility Initiative. This initiative is responsible for creating what many people know as the Web Content Accessibility Guidelines (WCAG) - pronounced “wuh-cag”, or “w-cag.” WCAG is a series of design and development recommendations for making the Web more accessible to people with disabilities. These guidelines are intended to support the creation of accessible content for persons with a variety of disabilities, including deafness, hearing loss, learning disabilities, cognitive limitations, limited movement, speech disabilities, blindness and low vision (WCAG, 2019).\n\nWCAG’s cousin ATAG (Authoring Tool Accessibility Guidelines) are lesser known, but are intended to support accessible creation tools. Just as important as consuming content, authoring tool accessibility helps put means of production in the control of many, and democratize the creation of new media and technologies.\n\nOne super cool thing that digital accessibility principles give everyone is a framework to effectively communicate information across multiple modalities. It’s also an opportunity to experiment with input and output types.\n\nP5 Access Work\n\nOver the last few years, p5.js has made great strides toward becoming a more accessibility-aware open-source community. A community that not only promotes and incorporates best practices, but pushes the bounds of communication and creativity.\n\nThe p5.js community took one of its first steps toward digital accessibility when Taeyoon Choi facilitated Signing Coders, a “series of workshops on creative expression with computer programming, art and poetry that focuses on reaching out to youth who are deaf or hard of hearing”(Choi, 2017). This initiative was the p5’s first and only educational initiative for accessibility designed from the beginning as an inclusive learning experience, with real-time transcription and ASL interpretation.\n\nShortly after this, Atul Varma and myself began teaching workshops on web development that incorporated prototypes of tools to make learning and using p5 more accessible to people that are blind and use screen reader technology. This work led to the creation of an accessible web development curriculum, and a better understanding of ways to support the accessibility of P5’s visual outputs.\n\nThe Processing foundation, true to its commitment to making coding a more accessible and inclusive practice, was generous to support the fellowship work of Mathura Govindarajan and Luis Morales-Navarro. With the help of a team of dedicated contributors (including Josh Mielle, Lauren McCarthy, Cassie Tarajakan, Antonio Guimaraes, Elizabeth G Betts, Mithru Vigneshwara, and Yossi Spira) these two endeavored to implement a system for making the visual outputs of p5 more accessible to people that are blind. This work led to the development of a p5.j5 accessibility library and work to make the p5 web editor more accessible.\n\nTo Do\n\nThe road to a more accessible p5.js is a long one, and will take the efforts of our whole community - not just those that develop p5.js as a library, but those that teach it, document it, and develop project work. During the P5.js Contributor’s conference in the Fall of 2019, the p5 community welcomed Sina Bahram to contribute and advise on the future of p5 Access work. This work yielded the following working areas:\n\nEducational work to promote awareness and skills\n\nWe need to tighten up our documentation of p5’s accessibility features and library.\n\nWe need to develop tutorials and trainings around web content accessibility for distribution amongst contributors and educators that use p5 in workshop/classroom settings.\n\nTactical Work to enhance the accessibility of the p5.js library and documentation\n\nWe need to make it clear in our documentation work what has been done, how to contribute (best practices doc), and what work is in the queue\n\nWork that is needed immediately: , we need to\n\nResearch to explore the dynamic generation of multimodal description of primitives and composites of primitives in a static scene to facilitate access for persons with disabilities.",
    "Bio": ["is an Art Therapist, Accessibility Specialist, Designer, and Developer. Her work centers around Disability, Human Computer Interaction, as well as, the accessibility of education technologies. http://www.takinglifeseriously.com/"],
    "Illustration": "open-cubes.jpg"
  },
  {
    "Author": "Luis Morales-Navarro",
    "Title": "What Does it Mean to be a Contributor?",
    "Text": "Four days into the p5.js Contributors Conference 2019 I realized that I was not sure of what it meant to be a contributor. After the conference, amazed and intrigued by the diverse ways in which people participate in this project I started asking questions, having conversations about the contributor identity with members of the p5.js community, and thinking through how the contributor identity fits into wider conversations about participation within FLOSS. As Johanna reflects, in p5 and Processing, open source is less about writing software and more about how software is written. [1] The p5.js contributor identity is constructed in response to the status quo of software development communities. Contributors are people that deeply care about making open source software more inclusive.\n\nFor some p5.js contributors like Aarón the emphasis on community is what motivates them to work on the project. “I decided to contribute when I realized that community and ethics were more important than the product itself,” they tell me in early October. Similarly, Evelyn explains that “contributors care more about the people that use the software and that work on it than the software itself.” Evelyn’s view resonates with plenty of the conversations I’ve had with contributors. This perspective is different from many ways in which FLOSS is theorized. Usually the social organizations of FLOSS are seen as a medium for writing efficient code; with emphasis on the “bazaar,” the writing of code, not on the people that make the bazaar possible. Lehmann argues for this common software-centered view saying that “to (nearly all) FLOSS developers, writing software is the focal point [...] the structure of projects is shaped by this, not by the achievement of some social change.” [2] However, when I talk to contributors most of them emphasize how they care about community, inclusion, and changing the social nature of FLOSS. “We don’t want to make the software with the most impressive graphics, it's about people, it's about beginners, that nobody feels left out,” a contributor tells me.\n\nThe p5.js contributor identity is different from most FLOSS developer identities because the p5 project itself was born with a clear goal of transforming how and who gets to write software. Lauren succinctly describes this: “I originally got involved with this work because I was frustrated by the lack of diversity in the open source world. I felt alone as a woman of color and wished for a space that was more welcoming to queer, trans, women, and people of color. p5.js became a way for me and many others who felt underrepresented, excluded, or intimidated to create an alternative together.” [3] Contributors share a commitment towards inclusion and making participants feel welcome. Cassie is “really impressed by how willing people are to be friendly. Because that is quite uncommon in the open source world. A community being friendly is so radical. And that's weird… why is that so radical?” “I feel welcomed and accepted here, which is something I don't feel in a lot of places,” Qianqian says. Xin agrees: “I always feel listened to and respected. It's shockingly a rare experience.” In the process of creating a project that prioritizes people and inclusion, contributors engage with critical questions about the nature of software and even what it means to be a contributor.\n\nContributors recognize that writing code is not the only way to become a contributor, they think teaching, organizing community events, creating tutorials, and documentation are valuable ways of contributing and building community. One contributor that I talked to even suggested that perhaps final users should also be considered contributors because without them there would be no reason for developing or teaching p5.js. However, contributors are aware that currently the community gives more importance to software development over other ways of contributing. Xin and Cassie wonder how contributions that are not code —teaching, community organizing, making projects— can be shared, encouraged and celebrated in the online community.\nIn thinking about the contributor identity, and who gets to be a contributor, contributors recognize that there’s a lot work to be done to make the project more inclusive. For some it is urgent to increase access for beginners and people with disabilities. Evelyn says that talking about inclusion and saying that everyone is welcome is not enough, she asks: “how can we prioritize people that have been marginalized over people that are welcome to any project?” There are some concerns about how the ideas behind the software are presented to final users, a contributor wonders how resources for learning how to code can incorporate questions about the role coding and software play in society. Other contributors recognize that the idea of a contributor carries values that might not easily translate to places with more conservative and authoritarian governments.\n\nThese are some of the things I’ve learned while working on an ongoing larger project about the contributor identity. Like many contributors, at first, I was hesitant to identify as a contributor, and I am still not fully comfortable with that label. But I am grateful to be part of this community and for the conversations the community is willing to have about what it means to be a contributor, [4] what it means to teach or make software, how software should be built, and who gets to participate.\n\n[1] Hedva, J. (2017, October 17). Belonging in the Mess. Retrieved from Processing Foundation: https://medium.com/processing-foundation/belonging-in-the-mess-3d3ad0577499\n[2] Lehmann, F. (2004). FLOSS Developers as A Social Formation. First Monday, 9(11).\n[3] McCarthy, L. (2019, November 25). Making Space for the Future of p5.js. Retrieved from Processing Foundation: https://medium.com/processing-foundation/making-space-for-the-future-of-p5-js-d3c6bd3da9ac\n[4] I am particularly grateful to Aarón Montoya-Moraga, Cassie Tarakajian, Evelyn Masso, Kate Hollenbach, Kenneth Lim, Lauren McCarthy, Qianqian Ye, Xin Xin and other contributors that took the time to talk me about their perceptions on the contributor identity.",
    "Bio": ["is interested in learning, the role communities play in creative learning, and computational fluency. He is passionate about making learning to code a creative endeavor, where we can express ourselves and learn from each other while making meaningful projects together. http://lm-n.com/"],
    "Illustration": "growth-accelerated.jpg"
  },
  {
    "Author": "Dorothy R. Santos",
    "Title": "Getting Picked Last",
    "Text": "All of the big ideas I come up with are always better in my head, such as learning code. Not that I ever thought learning would be easy, but I expected to pick it up rather quickly. The past few years have been humbling when it comes to learning code. Sometimes, I’m embarrassed to say that I’m not an expert coder especially as someone involved in the open source software for the arts community. I would like to see myself as someone who advocates and uplifts the work being done through creative code. While it has only been a handful of people that have said, “Oh, you do so much work with Processing Foundation, I figured you just know how to code really well,” it becomes disheartening. I wonder if I belong. I often ask myself, “Who do you think you are?”\n\nThe memory that hurts me when I think about it was the time I took an Introduction to Programming for Artists hybrid seminar (my second year as a PhD student) and feeling awful within the first week. I didn’t have the same skills as my classmates. I also wondered why on earth people who are so well-versed in programming enrolled in the class, but I let this thinking go. I couldn’t let anyone’s knowledge and experiences diminish me. I was there to learn. I was excited. I did the homework and worked hard to understand. Yet if I knew the majority of work entailed watching nothing but online tutorials with little discussion and guidance on coding languages and art, I wouldn’t have enrolled!\n\nThe last few weeks of the class seemed to sneak up on me and I was paired with someone who knew how to code well (also I wasn’t picked or asked by other groups or people to join their team, likewise, I was too scared to ask to join others). The instructor met with us and said to me, “You two will have to figure out how you will work together because I don’t want **** to end up having to do all of the coding.” My heart sank. I sat on this comment. **** didn’t say anything. As a matter of fact, I was disappointed in her for running off and doing her own project without communicating with me at all! I cried from the disappointment. This story might sound silly to someone reading this who has always been encouraged in the hard sciences or someone who is a masterful coder. And yes, I get that I have skills others don’t have. I write, facilitate, encourage, create weird stories, and I can even read through theory and have some relatively interesting conversations with my classmates. I also read tarot cards for people and I seem to have a knack for being a cheerleader for community members. But I yearned to gain some kind of technical skills, I still do.\n\nEven though I’m a lot older and a complete novice, I’m ecstatic when I practice and code works. I’m thrilled and I don’t care if hundreds before me figured out how to create a text generator in p5.js. I FIGURED it out by myself. I guess what I’m trying to say is that the open-source community, especially the p5.js community have been the most supportive and caring when it comes to my goals and aspirations of making art and creating new ways to present my writing.\n\nI ended up doing a project for the class (and passed!) because I watched Dan’s tutorial on using p5.js with the riTa library created by Daniel Howe and was inspired by some of the projects I researched in computational literature. I think one of the biggest takeaways was speaking with my professor and telling her I didn’t appreciate her lack of confidence in my abilities. While she was apologetic, I started to wonder and imagine what other students like me might be going through. Perhaps this is why Dan, Lauren, Casey, Ben, Saber, Johanna, and I care so much about the community and believe in accessibility and inclusion. There’s so much work to do because I had to go outside the structures of my institution to get the knowledge and skills to do the work I should have been learning from within it. I should have felt supported, but I had to look elsewhere. Thankfully, I didn’t have to look too far and everything I needed was within reach. This work is not easy and it takes so much intellectual, emotional, and physical labor to be present. My hope is to continue advocating and uplifting all of the work done within and for the p5.js community because it’s been so welcoming and open to me from the start.",
    "Bio": ["is a Filipina American writer and artist whose academic interests include digital art, computational media, games, and biotechnology. https://dorothysantos.com"],
    "Illustration": "eniac-programmers-2-a.jpg"
  },
  {
    "Author": "Xin Xin",
    "Title": "Random",
    "Text": "Image from p5.js sketch by Xin Xin: https://editor.p5js.org/xinxin/sketches/4twSdfwNA\n\nRandom is a messy word to define. There are many definitions out there, but none really come close to my relationship with randomness post 2016, where my understanding of continuities were broken and long-term goals were all of a sudden, random. It’s one of those words that is difficult to break down, because how we relate to randomness seems to be highly personal and always escaping, and not having a common language to articulate different types of unpredictability also doesn’t help. “Everything is going to be okay” is the phrase used to calm down the feelings of uncertainty towards randomness. In contrast, we seem to have a comprehensive toolkit to talk about putting objects in order and living lives that fit the narrative frame. If predictability is like the risk-aversive knots that have names and save lives, randomness is the densely tangled knot that requires enormous patience, invert and invert.\n\nThere are many different rabbit holes of ideas one can go down with randomness, but I’ve figured that I would start from the ones that are close to my practice. I taught an introduction to programming class using p5.js, where random() was introduced in the second week of the semester. In programming there is a distinction between something that is truly random and something that is pseudorandom. Close the book you’re holding right now — then open it back up at a random page —  and read the third word on that page. This is what’s commonly considered as true randomness as there is no strategy to predict what that word would be. Now visit this p5 sketch, which includes an array of the third word on every single page of the zine  —  hit the play button to have the program pick one out for you. This is what’s known as pseudorandomness, a simulation of neutral decision-making that is actually run by a pseudorandom number generator (PRNG), a number generating algorithm that underpins p5 random() and JavaScript Math.random().\n\nPRNG carries an initial value through various mathematical processes and spits out a seemingly unrelated number. What makes the word you’ve received from the p5 sketch less random than the word you’ve selected by opening the book at random is that the first method is a predictable process. Pseudorandomness lives in a closed-system, where an algorithm mixes and tosses numbers like salad but still follows a set of instructions. True randomness on the other hand is an open-system that takes acceleration, oscillation, and decay from the physical world as an interactive input. This method introduces variables so massive, chaotic, and unreadable by humans that we quickly accept its decision-making power. But nothing is random if we’re able to measure them  —  weather is an example of that. So the question seems to be more about whether something is random enough, in relation to what is predictable by technology.\n\nThere are people in the business of computers obsessed with achieving true randomness. Some of them are doing this for the sake of security, as PRNG underpins different types of cryptography. And some believes that being able to manufacture true randomness is an act of sublimity, riding alongside with the historical effort of wanting to use computation to simulate physical realities. Neither one of those reasons can explain my relationship with randomness. I’m a world-maker and not a world-builder, which means I'm interested in tools that mediate between realities more than tools that act as a self-sustaining system.\n\nWhen I think about true randomness, I think about pointing a camera at the river and using drifting water to affect the way I encounter digital information. Being enveloped in a world of advertisement-related algorithms means that I have to both internalize a series of defensive browsing behavior while simultaneously accept that my lack of trust in the digital world, which I spend so much of my time in, has become an inseparable part of my identity. I wonder if randomness can be used as a tool of disruption; a way to scramble our sense of continuity; and a noise that reveals the noises.",
    "Bio": ["is an interdisciplinary artist and educator working at the intersection of technology, labor, and identity. https://xin-xin.info"],
    "Illustration": "xin.png"
  },
  {
    "Author": "Johanna Hedva",
    "Title": "Notes on Activism",
    "Text": "The thing about activism is that it’s hard. It fails far more often than it succeeds. It’s exhausting. It’s frustrating. It burns you out. Any activist can tell you this but, for various reasons, it’s not much talked about. Indeed, it’s minimized, ignored, and even repressed. At the monthly meet-up with your collective, you’re not supposed to spend your time talking about how, say, the organizers got in an argument because one of them said something problematic, or how the website broke so no one could donate, or how only four people came to the last workshop, or—the list goes on. One ought not, seems to be the official rule, give too much space to this—the messy reality of activism—because it sits uncomfortably with one’s aims. When you’re trying to make the world not only a better place, but an entirely new one, being depleted, discouraged, and dismayed seems wrong. Where does fatigue fit into insurrection? It’s so incongruous to your ideals because it reminds you how the world actually is, not how you would like it to be. And this is a difficult truth to bear because it emphasizes how much more work there is to do.\n\nI’ve worked in activism for most of my adult life, and I’ve been getting paid to do it since 2014 by the Processing Foundation. But I don’t call myself an activist. Most activists I know don’t call themselves such. And we all tend to give the same reasons why: we say that there are so many others who are doing “real” activism, that our pitiful attempts don’t warrant the weight of the title. I bet this is not the actual reason. I think what we really mean is that activism is too arduous, too full of failure and defeat, for it to be given the vaunted status of a name that shares its root with the word “action.” So much of activism feels like the opposite of action: it’s a lot of little labors that are invisible but necessary; it’s so many delays, so much waiting; it’s things not working out the way you’d hoped; and it’s coming to terms with why your attempts failed, and may always fail. It’s persisting in the face of this—that you might always fail—and still choosing to try again.\n\nThe word “success” has been around for millennia, and its meaning has changed throughout history. In its earliest inception, it was the combination of two Latin roots, “sub” and “cedere,” which meant “next to, after,” and “go, move,” respectively. Success, as in “to succeed,” originally meant what came after, what followed, and it was a neutral fact, neither good nor bad. It had nothing to do with triumph or achievement, and didn’t come to mean what it does now—the accomplishment of a desired result—until the 1580s. It’s not a coincidence that that development occurred then. Capitalism began to take root in Europe in the 16th century, so it makes sense that how well a thing performed would come to measure the thing’s value.\n\nThis capitalist tenet is one that we’d do well to leave behind, because it’s not actually how the world works. Although it structures our reality, it’s not very realistic in practice. Most things don’t perform well: they break, don’t work, take longer, are expensive, and need more support than you thought. And when I say “things” I mean machines and objects, but also bodies, relationships, ideologies.\n\nWhen it comes to “success,” I’ve come to learn that the more exhausted you are, the more successful your activism has been. This is because, at its heart, activism is about trying to do something that’s never been done before—and the most important part of that sentence is the word “trying.” Exhaustion is the sign that you tried, that you gave it all you had. It’s not a done deal, it’s only ever an attempt.\n\nIt’s not just that there are no role models or guides. It’s not just that the world and its institutions are structured in opposition to what your activism is trying to do. It’s that, because activism is about radically re-doing how we do things, and have done them for generations, it will necessarily fail far more than otherwise, because no one has ever done this before. And not only is it new, but it agitates against a world that doesn’t want to change. It’s trying to do something that those in power don’t want to do. Of course it’s gonna fail.\n\nMaybe it’s a platitude to say that, but it gives me comfort. I’m reminded that activism shares its root with another word—actual. As much as activism is about dreaming into being something that doesn’t exist yet, it’s also about standing face-to-face with the actual mess of life. In that mess, there is exhaustion and failure, sure, because that’s what life is made of.\n\nFailure has become a thing that successful people in successful fields like to talk about. In those fields, which champion success as capitalism defines it, failure is positioned as valuable because it teaches you something, which pushes you to be “better.” I like the idea of failure being neutral, neither good nor bad, just a fact of life, what comes after what is done. I like thinking that activism will always fail. Because it means that the decision to take action, even in the face of certain defeat, is pure. It’s not going to get you paid, or bring you victory. It’s trying to do something that has never been done before, in the face of an indifferent and hostile world that doesn’t value this kind of action. It’s important because it is important. It is persisting. And that is enough.",
    "Bio": ["is a Korean-American writer, artist, musician, and astrologer, who was raised in Los Angeles by a family of witches, and now lives in LA and Berlin. Hedva’s practice cooks magic, necromancy, and divination together with mystical states of fury and ecstasy. https://johannahedva.com/"],
    "Illustration": "MNIST-01.jpg"
  }
]