[
  {
    "Author": "Casey REAS",
    "Title": "title? #58",
    "Text": "Casey REAS\n\nI was around for the birth of p5.js and I’m around now for the 1.0 release over six years later. My greatest contribution to the project was to keep my nose out of it. Through Lauren’s guidance and energy, p5.js has grown into something completely different from its parent, Processing. Both projects share the same domain and emphasize community and learning, but p5.js imagines a new, refreshing approach to situating coding within the arts and vice versa. Processing’s core is rooted in the culture at the turn of the century and p5.js points beyond 2020.\n\nAs I was thinking about the p5.js 1.0 release, something brought be back to the early days — to 2013. Some email searching to jog my memory led to a Github issue started on 29 August with the name “title?” The text that follows below is an edited discussion about how to name the nascent project that would become what we know as the amazing p5.js.\n\nThe cast of characters are Evelyn Eastmond (@evhan55), me (@REAS), Lauren McCarthy (@lmccart), Chandler McWilliams (@brysonian), Erik Blankenship (@jedierikb), and Dan Shiffman (@shiffman). The full discussion is here: https://github.com/processing/p5.js/issues/58\n\ntitle? #58\n\nevhan55 opened this issue on Aug 29, 2013 · 19 comments\n\nevhan55 commented on Aug 29, 2013\n\n@lmccart\n\nWhat is the official name of this library?\n\nProcessingJS\n\nProcessing-JS\n\nProcessing-js\n\nprocessing.js\n\nprocessingjs etc....\n\nHow are we differentiating from Processing.js?\n\nKeeping track of Processing, processing.org, Processing.js and processingjs.org and now this new library is going to be really confusing to many people. Perhaps something to bring up in the September4th/5th meeting?\n\nREAS commented on Sep 11, 2013\n\nRight now, I'm leaning toward the minimal “P5“ as the project name. I'm still fond of 'Ciel.' I'm curious about what the RISD grads might come up with.\n\nlmccart commented on Sep 12, 2013\n\nhm, it is an abbreviation for perl 5, but I think not too much googling overlap there.\n\nbrysonian commented on Oct 10, 2013\n\np5js has a lot of results, and p5js.com so that might not solve the confusion. I can't come up with much either though. I did like the name Cing for that cpp project that was going on. Maybe something similarly odd/nice sounding? jxing?\n\njedierikb commented on Oct 10, 2013\n\np5j5 ?\n\nhas a nice r2d2 ring to it.\n\nREAS commented on Oct 10, 2013\n\nMy daughter says “3PPO“ instead of C3PO. I wonder what we can learn from that?\n\nbrysonian commented on Oct 10, 2013\n\nppppp.js\n\nshiffman commented on Oct 10, 2013\n\ni think if you put a P in front of it, it will be perfect.\n\nlmccart commented on Oct 11, 2013\n\n👍\n\nevhan55 commented on Oct 25, 2013\n\nThe RISD grads haven't really chimed in, unfortunately. They are still getting a grasp of the difference between Processing, Processing.JS and this new version, and none of the students in my section have suggested alternatives.\n\nI am starting to lean towards “P5“ but not exactly fond of “ppppp“, it seems like a mouthful and beginners might wonder why. Also still really like “Ciel“ or anything completely different and fresh, but since this library builds on the Processing API so closely, the tie to 'proce55ing' seems nice.\n\nAlthough a quick Google search... http://www.sojamo.de/libraries/controlP5/\n\nIs P5 used in other places to refer to Processing?\n\nbrysonian commented on Oct 25, 2013\n\nIt was for years, not as much anymore. Something simple like draw.js might be nice too.\n\nREAS commented on Oct 25, 2013\n\n… After receiving so much negative feedback about the name “Processing“ over the years, I think common usage language names are tricky. However, maybe the advantages of the simple “draw.js“ outweigh these negatives. @evhan55, people naturally named Processing libraries with “pro“ and “p5“, but we discouraged them because it made them feel “official“ rather than “contributed.“ I don't think this is an issue for your project.\n\nlmccart closed this on Nov 1, 2013\n\njedierikb commented on Nov 1, 2013\n\nAnd... The title is????\n\nlmccart commented on Nov 1, 2013\n\nI believe we have settled on p5.js. @evhan55, is this right or is this still tentative?\n\nevhan55 commented on Nov 1, 2013\n\np5.js :)",
    "Bio": "Casey REAS is an artist.\n\nCasey REAS is an artist and co-founder of Processing.\n\nCasey REAS is an artist and co-founder of Processing and the Processing Foundation.\n\nhttp://reas.com/",
    "Illustration": "open-system.jpg"
  },
  {
    "Author": "Aarón Montoya-Moraga",
    "Title": "why i love p5.js and how did i get here",
    "Text": "p5.js is my favorite community, people, software, tool\nlet me first explain my journey so far, and highlight great people i have met\n2011 i used to be a struggling electrical engineering undergrad\nprofessor Rodrigo Cádiz who invited me to a computer music workshop\ni learned we could use code for arts, and met a beautiful community of media artists\n2012 i started learning Processing and still didn't understand what free libre open source meant\n2013 artist Margarita Gómez showed me openFrameworks and i couldn't figure out how to use it\n2014 performance artist María José Contreras hired me for my first job as a programmer for arts\ni met Delight Lab and they taught me some video mapping, i was hooked\n2015 i was accepted to NYU ITP, a two-year graduate school media arts program\nit was the first time they taught p5.js to first years instead of the usual Processing\nwe learned how to program cool wacky interactive websites and how the internet worked\nsince then i haven't stopped using p5.js :)\n2016 i took my favorite class at grad school, Lauren McCarthy's Performing User\ncheck it out, it is amazing  itp.nyu.edu/classes/performinguser/syllabus\nat engineering school i had been taught programming as an useful skill for making money\nat art school i was inspired by the creative potential of computers\ni became convinced artists and society would benefit from using code as a creative medium\none of my biggest privileges has been learning English and through that, access to education\nbut if you don't know English, i guess it's hard to know what you're missing, like p5.js\ni wished kids from Spanish speaking communities would have no barriers to their arts education\ni got a grant from the Processing Foundation that summer\nmy proposal was to translate to Spanish the p5.js website and book, and teach workshops\nthe website i18n had been started by Maya Man and i learned so much from her work\ni did rough translations of the book and website, but i feltl i should do more\n2017 after grad school, i spent that summer finishing the translations\nLee Tusman mentored me, Daniel Shiffman and Rune Madsen helped with code for the book\nTaeyoon Choi translated the artwork, Tyler Yin and Casey Reas made the book a reality\ni explained to Dorothy Santos, Lauren and Casey that the book should be online,\nin both pay-what-you-want PDF and optional physical copies\nand that all the source code should be available online for everyone to contribute\nthey were encouraging and made this dream a reality\nhere is the source code https://github.com/processing/p5.js-getting-started-es\nand the PDF and link for ordering physical copies https://processingfoundation.press/\ni was hired by NYU ITP to stay for one academic year as a research resident\nwith four of my best friends we started a media arts school called CODED Escuela\nCamila Colussi, Natalia Cabrera, Guille Montecinos, Christian Oyarzún\ntogether we taught p5.js in Chile and fostered the Chilean media arts community\n2018 i represented Processing Foundation in Argentina for the +CODE Festival\npeople were so excited to learn p5.js and celebrating media arts\n2019 i helped organize and taught at the Processing Community Day in Quito Ecuador with friends Gabriel Andrade, Ava Huang, Sharon Lee de la Cruz, Andrés Colubri\ni joined MIT where i am creating open source tools for arts and learning digital rights\ni attended the the second p5.js contributor's workshop and worked on the global track\nwith Yasheng She, Qianqian Ye, Kenneth Lim, Luis M-N, and so many others!\nwe helped each other figure out the role of p5.js in a worldwide context\nand discussed the sociopolitical aspects of software, of media arts, of sharing\n2020 in two months i will go again to PCD in Ecuador with Francesca Rodríguez-Sawaya\nshout out to Saber Khan for organizing Processing Community day 2020\neveryone i have met through p5.js and Processing has been inspiring and caring\nthey advice me to please don't burn out, to please self care, and enjoy the process\none of my favorite moments ever was when Francesca tagged me on a picture\nof the p5.js book in Spanish being used at schools in NYC to learn media arts\nthank you p5.js friends for caring about each other\nthank you for making this world a happier more ethical place with more art\n:)",
    "Bio": "uses synthesizers, machine learning, and computers for real-time audiovisual art projects, and is a contributor and open source software enthusiast, regularly teaching with and contributing to the p5.js, ml5.js, and Kinectron projects. https://montoyamoraga.io",
    "Illustration": "weak-ties.jpg"
  },
  {
    "Author": "Taeyoon Choi",
    "Title": "Oddkins",
    "Text": "This drawing by Taeyoon Choi was originally commissioned for the Getting Started with p5.js book by Lauren McCarthy, Casey Reas, and Ben Fry.\n\nI'm an oddkin of p5.js contributors. Oddkin is a word Donna Haraway uses to describe an unlikely intimacy. The word oddkin captures the essence of friendship I have in personal life, intellectual kinship with my students and peers at the School for Poetic Computation and in the geographically diverse nature of the Processing community. I'm bilingual, it's natural for me to try to translate the word into Korean. I looked up kin, which is 친척 (親戚 in Chinese). I don't think the word oddkin is translated into Korean. I asked if anyone would help translate it, and the media artist Masayuki Akamatsu suggested 기묘한동류 (妙な同類 in Japanese). It doesn’t have the earthy, crittery feel of oddkin, but it’s close enough. In this essay, I take an opportunity to think about you, my oddkins.\n\nDear oddkins. I’ve been lucky to participate in and help with the p5.js contributors conference at the STUDIO for Creative Inquiry in 2015 and remain a fan of the project. Some of my colleagues and students say they are trying to 'democratize' technology by making tools or resources. I'd like to challenge the implications created by the use of the word 'democracy' in this context. 'Democracy,' unlike ‘accessibility,’ implies a fair distribution of power, representation, and equity for everyone, but is complicated by ongoing questions of citizenship. How many times have you heard a hacker say, “I made this open source tool. Now everyone can do what I do!” What they don’t say is that to use it, you need to be technically fluent, accepted as a technical person, and have access to computers and networks. In reality, tools and resources alone cannot be democratic.\n\nWhat the p5.js project has done differently from the beginning is demystify stereotypes of who is seen as technical and/or artistic–the myth of the lone engineer capable of creating a powerful framework–and create a technical community where non-technical contributions are valued equally. This approach is truer to the reality of software and hardware development. There are almost always non-technical contributors who are integral to the success of any technology, including but not limited to writers, educators, testers, designers, and Quality Control professionals.\n\nThe questions of whiteness in the technology field remains. I've attended numerous software and hardware conferences over the years. Some were highly exclusive and self-selective, others were open and inviting to the newcomers. In the U.S. and Europe, the conference attendees were dominatingly white males. I could write a book about the troubling experiences I’ve had and witnessed at tech conferences. Older, established, white male engineers and academics making rude comments to female, gender non-conforming, people of color might need  a few chapters. Young tech dudes promising to solve the world's greatest challenges with code. “Introverts” who are actually just snobbish, escaping to their devices to avoid human contact but invasively stalking women with confidence. The most insidious forms of racism that happen offstage. How our speaker badge isn't enough for us to enter the speakers' lounge, how white bartenders treat us with offhand racist jokes, how we are tokenized for photo opportunities and a shout out on diversity statement. They can all get a chapter of their own in my book.\n\nTo survive in white spaces as a person of color, I learned to adapt to the expectations of others at first. Once I felt grounded, I leveraged my place to give voice to the others. Speaking up my truth made some people uncomfortable and I may have lost some opportunities. Speaking up brought me the respect of others, especially those who hold the power in white spaces.\n\nHow does one speak up to challenge the establishment? I think nuance and candor are essential to start a conversation. No one likes to be criticized, but everyone loves to be understood. When I was learning to code, a friend told me “treat your computer like your younger sibling.“ This approach of care and play is essential in exploratory and poetic computing. I think a similar approach is necessary to navigate the tech community. As the p5.js project grows in it’s scale and diversity, I want to ask. Who do we make our oddkins?",
    "Bio": "Taeyoon Choi is an artist and a cofounder of the School for Poetic Computation. https://taeyoonchoi.com https://sfpc.io",
    "Illustration": "taeyoon.png"
  },
  {
    "Author": "Aren Davey",
    "Title": "p5.js as a Family",
    "Text": "Image from the p5Grid library by Aren Davey: https://github.com/aahdee/p5grid\n\nCreating is a verb that I find describes my childhood and teenage years. By designing, crafting, and building, I morphed my wild imaginations into tangible objects. Intricate patterns and inventions sprung from my daydreams in my high school classes. I honestly wanted to choose graphic design or architecture for my career path, but since I did very well in the maths and sciences, my family pushed me towards those fields instead with the reason that they didn’t want my talents to go to waste. Since I didn’t want to disappoint them and I actually had an interest in engineering and scientific research, I promised that I’ll go to college for a degree in that field and almost completed every math class my high school offered. I also arrived at school almost an hour earlier for extra art classes, completed many studios, and did independent art study. Whether my intense motivation was to expand my interests or an act of small defiance is up for discussion, but my art practice has always been seen as an afterthought. Thus, I started to innately see it as an afterthought as well.\n\nQuite frankly, the p5.js community is not a group that I expected myself to be in. Having been intrigued by the concept of Processing and p5.js, I used the platform for my school work and expected that to be the extent of my involvement. Then through a string of chance happenings, I ended up at the 2019 p5.js Contributors Conference. I immediately felt out of place because I didn’t really feel like I deserved the title “contributor”. Like, I was 21, still in college but hanging on for dear life, and felt invisible compared to the other contributors that had a pretty substantial Twitter presence and were speaking at or hosting large conferences like Eyeo, maybe SIGGRAPH. I’d be entirely grateful if I could just see the door to the SIGGRAPH exhibition hall. One of the other attendees happened to be a visiting professor that was teaching a class that I was enrolled for the upcoming semester. All of these people are doing great things that were impacting the p5.js community and beyond so I didn’t feel like I deserved to be on the same level as them. Creating was only applied to projects that I finished for a grade, so I hadn’t ever done anything that I designed and executed myself. Thus, I felt pretty lost and doubtful if I could ever create anything for this community.\n\nBut after receiving the feedback that I got from pitching an idea that I had sitting in my head for a few months, creating a very dirty alpha for that idea, and seeing a visible, tangible, actual product sprout from that, I finally felt like a contributor. I saw that my art practice was taken seriously by others and there was genuine interest and need for it. Both of my interests, software development and fine arts, were seen of equal value and status. One wasn’t inherently better than the other, but instead they are both appreciated and valued in their own way. The p5.js community is a place where that holds true, so I’m glad that they have accepted me and that I have the chance to give back to them.\n\nI sometimes prefer to call the p5.js community a family instead. It’s more tight knit than other online developmental communities and its members are genuinely interested in the progress and evolution of others. I might not have the same amount of experience as most of the members, but that doesn’t make me less of a contributor. Everyone here is ready to assist others who need it and ensure that they go to places that they have never thought of before. This family exposed me to things I wouldn’t have seen without their help and has helped me develop as an artist and a contributor. No longer is my art practice felt as an afterthought; it is a significant piece of myself that is worth exploring, developing, and investing in and I’m very glad the p5.js family helped me come to that conclusion.",
    "Bio": "Aren Davey is a developer, artist, and aspiring graphic designer currently based in Pittsburgh. She is currently an undergraduate student at Carnegie Mellon University, pursuing a Bachelor of Computer Science and Fine Arts. She strives to break the stereotypes of programming by showing that it can be warm, playful, and spontaneous. In her downtime, she likes to steep tea, play video games, and pay homage to hexagons.  https://github.com/aahdee",
    "Illustration": "aren.png"
  },
  {
    "Author": "Stalgia Grigg",
    "Title": "p5 Fellow Experience",
    "Text": "During 2019, I served as a fellow for p5.js. During this year I was given the opportunity to operate as a co-leader for the project. This meant that I was given agency and responsibility in everything from maintaining the open-source codebase and developing a vision for future governance to designing the documentation for welcoming new contributors and honing the release roadmap based on the community mission. I have been a contributor to p5 for several years now, but it wasn’t until my experience with this fellowship that I finally understood the significance of the example that p5 is setting.\n\nMy path as a software developer has been closely aligned with p5 from the beginning. My first experiences coding were with p5. I first encountered a for-loop in the late nights poring over the online reference and examples for the p5 library as I made small experimental creative sketches. This began a lifelong dedication to and love for the craft of programming. That dedication led me to become a contributor to the project. I learned how to work on an open-source project through my engagement with p5. I can say confidently that if it wasn’t for the generous patience and understanding of the p5 community I would’ve been too intimidated or discouraged by my early mistakes to push through and achieve confidence in my status as a contributor. The p5 community offered a sense of comfort in learning through doing. This meant that I was able to learn a more advanced approach to software development and library architecture design, but it also meant that I learned by example how to be a steward for a web community. This process of learning eventually culminated in my experience as a fellow.\n\nAs a fellow, the responsibility that I was given gave me insight into the intention that forms the overarching shape of the project. p5 offers every possible avenue for involvement and empowerment. It offers a vast library of supporting educational resources so that people can learn how to code by making things. It offers a site for consideration and discussion of how a radically-inclusive software project can be a political act. It offers an intimidation-free, encouraging space to experiment with open-source contribution. It offers a flexible vision and malleable governance that empowers any contributor to reimagine the future of the project. All of these different angles for engagement are made available to anyone that shares a passion for p5’s mission. This forms an entire ecosystem that works tirelessly to empower people that have been historically left out of the conversation of how software tools and the open-web are built. My deep engagement with the p5 community led me through all of these different angles over time, giving me the gift of a path from self-taught coder to community-leader, software advocate, and mentor.\n\nMy experience as a p5 fellow has been formative in my understanding of how I want to interact with the world as a software engineer, tool-maker, developer, and activist. The approach that p5 exemplifies, community-forward and porous, is one that will fundamentally inform my future work organizing projects that fight for a radically-inclusive and definitively-open web.",
    "Bio": "Stalgia Grigg is dedicated to the indeterminate. http://stalgiagrigg.name/",
    "Illustration": "swarm-pattern.jpg"
  },
  {
    "Author": "Olivia McKayla Ross",
    "Title": "How to Write Non-Violent Creative Code",
    "Text": "",
    "Bio": "",
    "Illustration": ""
  },
  {
    "Author": "Claire Kearney-Volpe",
    "Title": "p5 Access, Keep it Coming!",
    "Text": "",
    "Bio": "",
    "Illustration": ""
  },
  {
    "Author": "Luis Morales-Navarro",
    "Title": "What Does it Mean to be a Contributor?",
    "Text": "",
    "Bio": "",
    "Illustration": ""
  },
  {
    "Author": "Dorothy R. Santos",
    "Title": "Getting Picked Last",
    "Text": "",
    "Bio": "Dorothy R. Santos is a Filipina American writer and artist whose academic interests include digital art, computational media, games, and biotechnology. https://dorothysantos.com",
    "Illustration": "eniac-programmers.jpg"
  },
  {
    "Author": "Xin Xin",
    "Title": "Random",
    "Text": "",
    "Bio": "",
    "Illustration": ""
  },
  {
    "Author": "Johanna Hedva",
    "Title": "Notes on Activism",
    "Text": "",
    "Bio": "",
    "Illustration": ""
  }
]